Ran Plan for 2 projects:

1. dir: `local-env` workspace: `default`
1. dir: `.` workspace: `default`
---

### 1. dir: `local-env` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.local-atlantis.helm_release.atlantis will be created
+ resource "helm_release" "atlantis" {
      + atomic                     = false
      + chart                      = "atlantis"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "local-atlantis"
      + namespace                  = (known after apply)
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://runatlantis.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "5.5.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.local-atlantis.kubernetes_namespace_v1.namespace will be created
+ resource "kubernetes_namespace_v1" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "local"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.local-monitoring.helm_release.prometheus will be created
+ resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "prometheus"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = (known after apply)
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "25.27.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.local-monitoring.kubernetes_namespace_v1.monitoring will be created
+ resource "kubernetes_namespace_v1" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d local-env
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=97-naushad%252Fproject-app%252Flocal-env%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d local-env
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis-data/repos/97-naushad/project-app/15/default/default.tfplan\"" in "/atlantis-data/repos/97-naushad/project-app/15/default": exit status 1
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

```

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```